# **Introduction to Pandas**
* **It is often said that 80% of data analysis activity is spent on the data cleaning and preparation of our data. To get the grip over this activity, this section will focus on a small but important aspect of data manipulation and cleaning with Pandas.**

## **Inbuilt Data Structure in Pandas**
**There are two types of data structures are there in Pandas -**
* **Series -** It is one-dimensional labeled array capable of holding any data type (integer, string, float, Python objects etc.) of data. The axis is collectively referred to as index.
* **Data Frame -** It is a two-dimensional labeled data structure with columns of potentially different types. You can think of it like a spreadsheet or SQL Table or a Series of objects

In [1]:
# importing all required modules
import pandas as pd
import numpy as np

## **Series Data Structure**
**pandas.core.series.Series(data, index, dtype, copy)**
* **data -** data takes various forms like ndarray, list, constants, dictionary etc.
* **index -** it is unique and hashable for easy identification.
* **dtype -** it is for data type.
* **copy -** copy data, and its default value is False. It only affects for Series or one dimensional ndarray inputs.

In [2]:
# creating empty Series
s = pd.Series()
print (s, type(s))

Series([], dtype: object) <class 'pandas.core.series.Series'>

In [3]:
arr_data = np.array([100, 200, 400, 500, 300])
print (arr_data)
s = pd.Series(data = arr_data, copy = False)
print (s)
s[2] = 999
arr_data[3] = 888
print (arr_data)
print (s)

[100 200 400 500 300]
0    100
1    200
2    400
3    500
4    300
dtype: int64
[100 200 999 888 300]
0    100
1    200
2    999
3    888
4    300
dtype: int64

In [4]:
arr_data = np.array([100, 200, 400, 500, 300])
print (arr_data)
s = pd.Series(data = arr_data, copy = True)
print (s)
s[2] = 999
arr_data[3] = 888
print (arr_data)
print (s)

[100 200 400 500 300]
0    100
1    200
2    400
3    500
4    300
dtype: int64
[100 200 400 888 300]
0    100
1    200
2    999
3    500
4    300
dtype: int64

In [5]:
arr_data = np.array(['apple', 'banana', 'cherry', 'pineapple'])
print (arr_data, len(arr_data))
s = pd.Series(data = arr_data)
print (s)
print (s[0], s[2])

['apple' 'banana' 'cherry' 'pineapple'] 4
0        apple
1       banana
2       cherry
3    pineapple
dtype: object
apple cherry

In [6]:
arr_data = np.array(['apple', 'banana', 'cherry', 'pineapple'])
print (arr_data, len(arr_data))
s = pd.Series(data = arr_data, index = [100, 103, 101, 103])
print (s)
print (s[100], type(s[100]))
print (s[103], type(s[103]))

['apple' 'banana' 'cherry' 'pineapple'] 4
100        apple
103       banana
101       cherry
103    pineapple
dtype: object
apple <class 'str'>
103       banana
103    pineapple
dtype: object <class 'pandas.core.series.Series'>

In [7]:
arr_data = np.array(['apple', 'banana', 'cherry', 'pineapple'])
print (arr_data, len(arr_data))
s = pd.Series(data = arr_data, index = [100, 103, 100, 103])
print (s)
print (s[100])
print (s[103])

['apple' 'banana' 'cherry' 'pineapple'] 4
100        apple
103       banana
100       cherry
103    pineapple
dtype: object
100     apple
100    cherry
dtype: object
103       banana
103    pineapple
dtype: object

In [8]:
import warnings
warnings.filterwarnings('ignore')

In [9]:
arr_data = np.array(['apple', 'banana', 'cherry', 'pineapple'])
print (arr_data, len(arr_data))
s = pd.Series(data = arr_data, index = ['fruit-1', 'fruit-2', 'fruit-3', 'fruit-4'])
print (s)
print (s['fruit-1'], s[0])
print (s['fruit-3'], s[2])

['apple' 'banana' 'cherry' 'pineapple'] 4
fruit-1        apple
fruit-2       banana
fruit-3       cherry
fruit-4    pineapple
dtype: object
apple apple
cherry cherry

In [10]:
# create a Series from a dictionary
dict_data = {'apple':104, 'banana':306, 'pineapple': '455', 'coconut':897}
print (dict_data, len(dict_data))
s = pd.Series(dict_data)
print (s)

{'apple': 104, 'banana': 306, 'pineapple': '455', 'coconut': 897} 4
apple        104
banana       306
pineapple    455
coconut      897
dtype: object

In [11]:
dict_data = {'apple':104, 'banana':306, 'pineapple': '455', 'coconut':897}
print (dict_data, len(dict_data))
s = pd.Series(dict_data, index = ['pineapple', 'apple', 'cherry', 'apple', 'coconut', 'mango'])
print (s)

{'apple': 104, 'banana': 306, 'pineapple': '455', 'coconut': 897} 4
pineapple    455
apple        104
cherry       NaN
apple        104
coconut      897
mango        NaN
dtype: object

In [12]:
# create a Series from a scalar
s = pd.Series(50, index = [0, 1, 2, 3, 4, 5])
print (s)
s = pd.Series(60, index = [0, 2, 1, 3, 2, 3])
print (s)

0    50
1    50
2    50
3    50
4    50
5    50
dtype: int64
0    60
2    60
1    60
3    60
2    60
3    60
dtype: int64

In [13]:
# create a Series from a list
s = pd.Series(data = [101, 103, 102, 105, 104], index = ('red', 'blue', 'brown', 'black', 'white'))
print (s)
print (s['blue'], s[1])
print (s.sort_index())
print (s.sort_values())
print (s.argmax(), s.argmin())
print (s.count())

red      101
blue     103
brown    102
black    105
white    104
dtype: int64
103 103
black    105
blue     103
brown    102
red      101
white    104
dtype: int64
red      101
brown    102
blue     103
white    104
black    105
dtype: int64
3 0
5

## **Data Frame Data Structure**

In [14]:
data_dict = {'emp_name':['Amal','Kamal','Bimal','Shymal'], 'emp_age':[45, 47, 46, 49]}
emp_id = [1001, 1002, 1003, 1004]
df = pd.DataFrame(data = data_dict)
print (df)
df

  emp_name  emp_age
0     Amal       45
1    Kamal       47
2    Bimal       46
3   Shymal       49

  emp_name  emp_age
0     Amal       45
1    Kamal       47
2    Bimal       46
3   Shymal       49

In [15]:
data_dict = {'emp_name':['Amal','Kamal','Bimal','Shymal'], 'emp_age':[45, 47, 46, 49]}
emp_id = [1001, 1002, 1003, 1004]
df = pd.DataFrame(data = data_dict, index = emp_id)
df

     emp_name  emp_age
1001     Amal       45
1002    Kamal       47
1003    Bimal       46
1004   Shymal       49

In [16]:
data_dict = {'emp_name':['Amal','Kamal','Bimal','Shymal'], 'emp_age':[45, 47, 46, 49]}
emp_id = [1001, 1002, 1003, 1004]
df = pd.DataFrame(data = data_dict, index = emp_id)
df = df.reset_index()
print (df)
df = df.rename(columns = {"index":"emp_id", 'emp_name':'emp_fullname'})
df

   index emp_name  emp_age
0   1001     Amal       45
1   1002    Kamal       47
2   1003    Bimal       46
3   1004   Shymal       49

   emp_id emp_fullname  emp_age
0    1001         Amal       45
1    1002        Kamal       47
2    1003        Bimal       46
3    1004       Shymal       49

## **Different ways to create a Data Frame**

In [17]:
user_data = [['alice', 19, 'F', 'student'], ['john', 26, 'M', 'student']]  # list of lists
user_columns = ['name', 'age', 'gender', 'job']
user1 = pd.DataFrame(data = user_data, columns = user_columns)

user_data = dict(name = ['eric', 'paul'], age = [22, 58], gender = ['M', 'F'], job = ['student', 'manager'])
print (user_data)
user2 = pd.DataFrame(data = user_data)

user_data = {'name':['peter', 'julie'], 'age':[33, 44], 'gender':['M', 'F'], 'job':['engineer', 'scientist']}
user3 = pd.DataFrame(data = user_data)

print (user1)
print (user2)
print (user3)

{'name': ['eric', 'paul'], 'age': [22, 58], 'gender': ['M', 'F'], 'job': ['student', 'manager']}
    name  age gender      job
0  alice   19      F  student
1   john   26      M  student
   name  age gender      job
0  eric   22      M  student
1  paul   58      F  manager
    name  age gender        job
0  peter   33      M   engineer
1  julie   44      F  scientist

## **Concatenate Data Frames**

In [18]:
users = pd.concat([user1, user2])
print (users)
print ()
users = pd.concat([user1, user2, user3])
print (users)

    name  age gender      job
0  alice   19      F  student
1   john   26      M  student
0   eric   22      M  student
1   paul   58      F  manager

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
0   eric   22      M    student
1   paul   58      F    manager
0  peter   33      M   engineer
1  julie   44      F  scientist

In [19]:
users = pd.concat([user1, user2], ignore_index=True)
print (users)
print ()
users = pd.concat([user1, user2, user3], ignore_index=True)
print (users)

    name  age gender      job
0  alice   19      F  student
1   john   26      M  student
2   eric   22      M  student
3   paul   58      F  manager

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [20]:
# DataFrame to NumPy ndArray
arr_data = user1.to_numpy()
print (arr_data, type(arr_data))
arr_data = np.array(user1)
print (arr_data, type(arr_data))
arr_data = np.array(user1[['name', 'gender']])
print (arr_data, type(arr_data))

[['alice' 19 'F' 'student']
 ['john' 26 'M' 'student']] <class 'numpy.ndarray'>
[['alice' 19 'F' 'student']
 ['john' 26 'M' 'student']] <class 'numpy.ndarray'>
[['alice' 'F']
 ['john' 'M']] <class 'numpy.ndarray'>

## **Join Data Frame**

In [21]:
dict_data = dict(name = ['alice','john','eric','julie','rita'], height = [165, 168, 170, 180, 167])
user4 = pd.DataFrame(data = dict_data)
user4

    name  height
0  alice     165
1   john     168
2   eric     170
3  julie     180
4   rita     167

In [22]:
users

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [23]:
# inner join: all matching rows from both the data frames
merge_inner = pd.merge(users, user4, on = 'name', how = 'inner')
merge_inner

    name  age gender        job  height
0  alice   19      F    student     165
1   john   26      M    student     168
2   eric   22      M    student     170
3  julie   44      F  scientist     180

In [24]:
# inner join: all matching rows from both the data frames
merge_inner = pd.merge(users, user4, on = 'name')
merge_inner

    name  age gender        job  height
0  alice   19      F    student     165
1   john   26      M    student     168
2   eric   22      M    student     170
3  julie   44      F  scientist     180

In [25]:
# outer join: all rows from both the data frames matching or not matching
merge_outer = pd.merge(users, user4, on = 'name', how = 'outer')
merge_outer

    name   age gender        job  height
0  alice  19.0      F    student   165.0
1   john  26.0      M    student   168.0
2   eric  22.0      M    student   170.0
3   paul  58.0      F    manager     NaN
4  peter  33.0      M   engineer     NaN
5  julie  44.0      F  scientist   180.0
6   rita   NaN    NaN        NaN   167.0

In [26]:
print (merge_outer.size)

35

In [27]:
merge_outer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    7 non-null      object
 1   age     6 non-null      float64
 2   gender  6 non-null      object
 3   job     6 non-null      object
 4   height  5 non-null      float64
dtypes: float64(2), object(3)
memory usage: 408.0+ bytes

In [28]:
# left outer join: all rows from the left data frame and only matching rows from the right data frame
merge_left_outer = pd.merge(users, user4, on = 'name', how = 'left')
merge_left_outer

    name  age gender        job  height
0  alice   19      F    student   165.0
1   john   26      M    student   168.0
2   eric   22      M    student   170.0
3   paul   58      F    manager     NaN
4  peter   33      M   engineer     NaN
5  julie   44      F  scientist   180.0

In [29]:
# right outer join: only all matching rows from the left data frame and all rows from the right data frame
merge_right_outer = pd.merge(users, user4, on = 'name', how = 'right')
merge_right_outer

    name   age gender        job  height
0  alice  19.0      F    student     165
1   john  26.0      M    student     168
2   eric  22.0      M    student     170
3  julie  44.0      F  scientist     180
4   rita   NaN    NaN        NaN     167

## **Summarizing**

In [30]:
users

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [31]:
users.head(3)   # by default first 5 records

    name  age gender      job
0  alice   19      F  student
1   john   26      M  student
2   eric   22      M  student

In [32]:
users.tail(3)   # by default last 5 records

    name  age gender        job
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [33]:
users.sample(3)   # any 3 rows randomly selected

    name  age gender       job
2   eric   22      M   student
0  alice   19      F   student
4  peter   33      M  engineer

In [34]:
print (users.shape, type(users.shape))
print (f"Number of rows = {users.shape[0]} and cols = {users.shape[1]}...")
print (users.index)
print (users.dtypes, type(users.dtypes))
print (users.columns)

(6, 4) <class 'tuple'>
Number of rows = 6 and cols = 4...
RangeIndex(start=0, stop=6, step=1)
name      object
age        int64
gender    object
job       object
dtype: object <class 'pandas.core.series.Series'>
Index(['name', 'age', 'gender', 'job'], dtype='object')

In [35]:
print (type(users))
print (users.any())

<class 'pandas.core.frame.DataFrame'>
name      True
age       True
gender    True
job       True
dtype: bool

In [36]:
users

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [37]:
print (users.values)
print (type(users.values))
print (users.values.shape, users.values.ndim, users.values.size, len(users.values))

[['alice' 19 'F' 'student']
 ['john' 26 'M' 'student']
 ['eric' 22 'M' 'student']
 ['paul' 58 'F' 'manager']
 ['peter' 33 'M' 'engineer']
 ['julie' 44 'F' 'scientist']]
<class 'numpy.ndarray'>
(6, 4) 2 24 6

In [38]:
print (users.gender.value_counts())
print (users.job.value_counts())

gender
F    3
M    3
Name: count, dtype: int64
job
student      3
manager      1
engineer     1
scientist    1
Name: count, dtype: int64

In [39]:
users.describe()

             age
count   6.000000
mean   33.666667
std    14.895189
min    19.000000
25%    23.000000
50%    29.500000
75%    41.250000
max    58.000000

In [40]:
users.describe().T

     count       mean        std   min   25%   50%    75%   max
age    6.0  33.666667  14.895189  19.0  23.0  29.5  41.25  58.0

In [41]:
users.describe().transpose()

     count       mean        std   min   25%   50%    75%   max
age    6.0  33.666667  14.895189  19.0  23.0  29.5  41.25  58.0

In [42]:
users.describe(include=['object']).T

       count unique      top freq
name       6      6    alice    1
gender     6      2        F    3
job        6      4  student    3

In [43]:
users.describe(include='all').T

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
name,6,6,alice,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN
age,6.0,NaN,NaN,NaN,33.666667,14.895189,19.0,23.0,29.5,41.25,58.0
gender,6,2,F,3,NaN,NaN,NaN,NaN,NaN,NaN,NaN
job,6,4,student,3,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [44]:
users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    6 non-null      object
 1   age     6 non-null      int64
 2   gender  6 non-null      object
 3   job     6 non-null      object
dtypes: int64(1), object(3)
memory usage: 320.0+ bytes

## **Column Selection**

In [45]:
users

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [46]:
users.name

0    alice
1     john
2     eric
3     paul
4    peter
5    julie
Name: name, dtype: object

In [47]:
users['name']

0    alice
1     john
2     eric
3     paul
4    peter
5    julie
Name: name, dtype: object

In [48]:
users[['name', 'age', 'gender']]

    name  age gender
0  alice   19      F
1   john   26      M
2   eric   22      M
3   paul   58      F
4  peter   33      M
5  julie   44      F

In [49]:
my_columns = ['age', 'name', 'gender']
users[my_columns]

   age   name gender
0   19  alice      F
1   26   john      M
2   22   eric      M
3   58   paul      F
4   33  peter      M
5   44  julie      F

## **Row Selection**

In [50]:
import warnings
warnings.filterwarnings('ignore')

In [51]:
users

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [52]:
print (users.iloc[4][3], users.iloc[4]['job'], users.loc[4][3], users.loc[4]['job'])
print (users.iloc[4, 3], users.iloc[4]['job'], users.loc[4][3], users.loc[4, 'job'])

engineer engineer engineer engineer
engineer engineer engineer engineer

In [53]:
df = users.copy()
df

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [54]:
# increasing all age values by 100
df = users.copy()
for i in range(df.shape[0]):
    current_row = df.loc[i]
    current_row.age += 100
    df.iloc[i] = current_row
df

    name  age gender        job
0  alice  119      F    student
1   john  126      M    student
2   eric  122      M    student
3   paul  158      F    manager
4  peter  133      M   engineer
5  julie  144      F  scientist

In [55]:
print (df.shape, df.shape[0], df.shape[1])

(6, 4) 6 4

## **Row Selection and Filtering**

In [56]:
users

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [57]:
users.age < 30

0     True
1     True
2     True
3    False
4    False
5    False
Name: age, dtype: bool

In [58]:
users[users.age < 30]

    name  age gender      job
0  alice   19      F  student
1   john   26      M  student
2   eric   22      M  student

In [59]:
users[users.age < 30][['name', 'age']]
# select name, age from users where age < 30;

    name  age
0  alice   19
1   john   26
2   eric   22

In [60]:
users[users.age < 30].name

0    alice
1     john
2     eric
Name: name, dtype: object

In [61]:
users[users.age < 30]['name']

0    alice
1     john
2     eric
Name: name, dtype: object

In [62]:
(users.age > 30) & (users.gender == 'F')

0    False
1    False
2    False
3     True
4    False
5     True
dtype: bool

In [63]:
users[(users.age > 30) & (users.gender == 'F')]

    name  age gender        job
3   paul   58      F    manager
5  julie   44      F  scientist

In [64]:
users[(users.age > 30) & (users.gender == 'F')][['name', 'job']]

    name        job
3   paul    manager
5  julie  scientist

In [65]:
users[(users.age > 30) | (users.gender == 'F')][['name', 'age', 'gender']]
# select name, age, gender
# from users
# where gender = 'F' or age > 30;

    name  age gender
0  alice   19      F
3   paul   58      F
4  peter   33      M
5  julie   44      F

In [66]:
users[users.job.isin(['engineer', 'student'])]

    name  age gender       job
0  alice   19      F   student
1   john   26      M   student
2   eric   22      M   student
4  peter   33      M  engineer

In [67]:
users[users.job.isin(['engineer', 'student'])][['name', 'job']]

    name       job
0  alice   student
1   john   student
2   eric   student
4  peter  engineer

In [68]:
users[(users.job == 'engineer') | (users.job == 'student')]

    name  age gender       job
0  alice   19      F   student
1   john   26      M   student
2   eric   22      M   student
4  peter   33      M  engineer

In [69]:
users

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

**Class Work:**
<b>
<pre>
Select all record where if gender is M then age should be greater than 25
                     or if gender is F then age should be greater than 50
</pre>
</b>

In [70]:
users[((users.gender == 'M') & (users.age > 25)) | ((users.gender == 'F') & (users.age > 50))]

    name  age gender       job
1   john   26      M   student
3   paul   58      F   manager
4  peter   33      M  engineer

## **Sorting**

In [71]:
df = users.copy()
print (df.age)
print (df.age.sort_values())

0    19
1    26
2    22
3    58
4    33
5    44
Name: age, dtype: int64
0    19
2    22
1    26
4    33
5    44
3    58
Name: age, dtype: int64

In [72]:
df.sort_values(by = 'age')

    name  age gender        job
0  alice   19      F    student
2   eric   22      M    student
1   john   26      M    student
4  peter   33      M   engineer
5  julie   44      F  scientist
3   paul   58      F    manager

In [73]:
df.sort_values(by = 'age', ascending = False)

    name  age gender        job
3   paul   58      F    manager
5  julie   44      F  scientist
4  peter   33      M   engineer
1   john   26      M    student
2   eric   22      M    student
0  alice   19      F    student

In [74]:
df

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [75]:
df.sort_values(by = 'age', ascending = False, inplace = True)
df.index = range(df.shape[0])
df

    name  age gender        job
0   paul   58      F    manager
1  julie   44      F  scientist
2  peter   33      M   engineer
3   john   26      M    student
4   eric   22      M    student
5  alice   19      F    student

In [76]:
df.index

RangeIndex(start=0, stop=6, step=1)

## **Unpivot and Pivot**
* **unpivot =>** Wide format (unstacked format) to Long Format (Stacked Format)
* **pivot =>** Long Format (Stacked Format) to Wide format (unstacked format)

In [77]:
users

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [78]:
# performing the unpivot operation: wide format to long format
stacked = pd.melt(users, id_vars='name', var_name="my_variable", value_name='my_value')
stacked

     name my_variable   my_value
0   alice         age         19
1    john         age         26
2    eric         age         22
3    paul         age         58
4   peter         age         33
5   julie         age         44
6   alice      gender          F
7    john      gender          M
8    eric      gender          M
9    paul      gender          F
10  peter      gender          M
11  julie      gender          F
12  alice         job    student
13   john         job    student
14   eric         job    student
15   paul         job    manager
16  peter         job   engineer
17  julie         job  scientist

In [79]:
unstacked = stacked.pivot(index='name', columns='my_variable', values='my_value')
unstacked.reset_index(inplace=True)
print (unstacked.columns)
print (unstacked.columns.name)
unstacked.columns.name = ""
unstacked

Index(['name', 'age', 'gender', 'job'], dtype='object', name='my_variable')
my_variable

    name age gender        job
0  alice  19      F    student
1   eric  22      M    student
2   john  26      M    student
3  julie  44      F  scientist
4   paul  58      F    manager
5  peter  33      M   engineer

## **Quality Control: Duplicate Data**

In [80]:
df = users.copy()
df = pd.concat([df, df[df.index == 0]])
df = pd.concat([df, df[df.index == 2]])
df = pd.concat([df, df[df.index == 3]])
df = pd.concat([df, df[df.index == 4]], ignore_index=True)
df.sort_values(by = 'name', inplace=True)
df.index = range(df.shape[0])
df

    name  age gender        job
0  alice   19      F    student
1  alice   19      F    student
2   eric   22      M    student
3   eric   22      M    student
4   john   26      M    student
5  julie   44      F  scientist
6   paul   58      F    manager
7   paul   58      F    manager
8  peter   33      M   engineer
9  peter   33      M   engineer

In [81]:
df.duplicated()   # returns a boolean series

0    False
1     True
2    False
3     True
4    False
5    False
6    False
7     True
8    False
9     True
dtype: bool

In [82]:
df[df.duplicated()]

    name  age gender       job
1  alice   19      F   student
3   eric   22      M   student
7   paul   58      F   manager
9  peter   33      M  engineer

In [83]:
df[~df.duplicated()]

    name  age gender        job
0  alice   19      F    student
2   eric   22      M    student
4   john   26      M    student
5  julie   44      F  scientist
6   paul   58      F    manager
8  peter   33      M   engineer

In [84]:
df['job'].duplicated()

0    False
1     True
2     True
3     True
4     True
5    False
6    False
7     True
8    False
9     True
Name: job, dtype: bool

In [85]:
df.gender.duplicated()

0    False
1     True
2    False
3     True
4     True
5     True
6     True
7     True
8     True
9     True
Name: gender, dtype: bool

In [86]:
df1 = df.copy()
df1.drop_duplicates(inplace=True)
df1.index = range(df1.shape[0])
df1

    name  age gender        job
0  alice   19      F    student
1   eric   22      M    student
2   john   26      M    student
3  julie   44      F  scientist
4   paul   58      F    manager
5  peter   33      M   engineer

## **Quality Control: Missing Data**

In [87]:
df = merge_left_outer.copy()
df

    name  age gender        job  height
0  alice   19      F    student   165.0
1   john   26      M    student   168.0
2   eric   22      M    student   170.0
3   paul   58      F    manager     NaN
4  peter   33      M   engineer     NaN
5  julie   44      F  scientist   180.0

In [88]:
df.describe(include='all').T

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
name,6,6,alice,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN
age,6.0,NaN,NaN,NaN,33.666667,14.895189,19.0,23.0,29.5,41.25,58.0
gender,6,2,F,3,NaN,NaN,NaN,NaN,NaN,NaN,NaN
job,6,4,student,3,NaN,NaN,NaN,NaN,NaN,NaN,NaN
height,4.0,NaN,NaN,NaN,170.75,6.5,165.0,167.25,169.0,172.5,180.0

In [89]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    6 non-null      object
 1   age     6 non-null      int64
 2   gender  6 non-null      object
 3   job     6 non-null      object
 4   height  4 non-null      float64
dtypes: float64(1), int64(1), object(3)
memory usage: 368.0+ bytes

In [90]:
df.isnull()

    name    age  gender    job  height
0  False  False   False  False   False
1  False  False   False  False   False
2  False  False   False  False   False
3  False  False   False  False    True
4  False  False   False  False    True
5  False  False   False  False   False

In [91]:
print (df.height.isnull())
print (f"So total number of NaN values in height column is {df.height.isnull().sum()}")

0    False
1    False
2    False
3     True
4     True
5    False
Name: height, dtype: bool
So total number of NaN values in height column is 2

In [92]:
print (df.notnull())
print (df.height.notnull())

   name   age  gender   job  height
0  True  True    True  True    True
1  True  True    True  True    True
2  True  True    True  True    True
3  True  True    True  True   False
4  True  True    True  True   False
5  True  True    True  True    True
0     True
1     True
2     True
3    False
4    False
5     True
Name: height, dtype: bool

In [93]:
print (~df.height.notnull())
print (f"So total number of NaN values in height column is {(~df.height.notnull()).sum()}")

0    False
1    False
2    False
3     True
4     True
5    False
Name: height, dtype: bool
So total number of NaN values in height column is 2

In [94]:
print (df.notnull().sum())
print ()
print (df.isnull().sum())

name      6
age       6
gender    6
job       6
height    4
dtype: int64

name      0
age       0
gender    0
job       0
height    2
dtype: int64

In [95]:
df[df['height'].isnull()]

    name  age gender       job  height
3   paul   58      F   manager     NaN
4  peter   33      M  engineer     NaN

In [96]:
df[df['height'].notnull()]

    name  age gender        job  height
0  alice   19      F    student   165.0
1   john   26      M    student   168.0
2   eric   22      M    student   170.0
5  julie   44      F  scientist   180.0

In [97]:
df[~df['height'].isnull()]

    name  age gender        job  height
0  alice   19      F    student   165.0
1   john   26      M    student   168.0
2   eric   22      M    student   170.0
5  julie   44      F  scientist   180.0

In [98]:
# strategy - 1: deleting rows containing null values
df = merge_left_outer.copy()
df.dropna(inplace = True)
df

    name  age gender        job  height
0  alice   19      F    student   165.0
1   john   26      M    student   168.0
2   eric   22      M    student   170.0
5  julie   44      F  scientist   180.0

In [99]:
df = merge_left_outer.copy()
df.dropna(inplace = True, how = 'all')
df

    name  age gender        job  height
0  alice   19      F    student   165.0
1   john   26      M    student   168.0
2   eric   22      M    student   170.0
3   paul   58      F    manager     NaN
4  peter   33      M   engineer     NaN
5  julie   44      F  scientist   180.0

In [100]:
# strategy - 2: filling up columns containing null values
df = merge_left_outer.copy()
df.fillna(0, inplace = True)
df

    name  age gender        job  height
0  alice   19      F    student   165.0
1   john   26      M    student   168.0
2   eric   22      M    student   170.0
3   paul   58      F    manager     0.0
4  peter   33      M   engineer     0.0
5  julie   44      F  scientist   180.0

In [101]:
df = merge_left_outer.copy()
height_average = df.height.mean()
print (f"Average of the height values is {height_average}")
df.fillna(height_average, inplace = True)
df

Average of the height values is 170.75

    name  age gender        job  height
0  alice   19      F    student  165.00
1   john   26      M    student  168.00
2   eric   22      M    student  170.00
3   paul   58      F    manager  170.75
4  peter   33      M   engineer  170.75
5  julie   44      F  scientist  180.00

In [102]:
# forward fill
df = merge_left_outer.copy()
df.sort_values(by = 'age', inplace = True)
df.index = range(df.shape[0])
df

    name  age gender        job  height
0  alice   19      F    student   165.0
1   eric   22      M    student   170.0
2   john   26      M    student   168.0
3  peter   33      M   engineer     NaN
4  julie   44      F  scientist   180.0
5   paul   58      F    manager     NaN

In [103]:
df.fillna(method='pad', inplace=True)
df

    name  age gender        job  height
0  alice   19      F    student   165.0
1   eric   22      M    student   170.0
2   john   26      M    student   168.0
3  peter   33      M   engineer   168.0
4  julie   44      F  scientist   180.0
5   paul   58      F    manager   180.0

In [104]:
# backward fill
df = merge_left_outer.copy()
df.sort_values(by = 'job', inplace = True)
df.index = range(df.shape[0])
df

    name  age gender        job  height
0  peter   33      M   engineer     NaN
1   paul   58      F    manager     NaN
2  julie   44      F  scientist   180.0
3  alice   19      F    student   165.0
4   john   26      M    student   168.0
5   eric   22      M    student   170.0

In [105]:
df.fillna(method = 'bfill', inplace=True)
df

    name  age gender        job  height
0  peter   33      M   engineer   180.0
1   paul   58      F    manager   180.0
2  julie   44      F  scientist   180.0
3  alice   19      F    student   165.0
4   john   26      M    student   168.0
5   eric   22      M    student   170.0

## **Rename Column Names in a Data Frame**

In [106]:
df = users.copy()
new_column_names = ['new_name', 'new_age', 'new_gender', 'new_job']
df.columns = new_column_names
df

  new_name  new_age new_gender    new_job
0    alice       19          F    student
1     john       26          M    student
2     eric       22          M    student
3     paul       58          F    manager
4    peter       33          M   engineer
5    julie       44          F  scientist

In [107]:
df = users.copy()
df = df.rename(columns = {'name':'emp_name', 'age':'emp_age', 'gender':'emp_gender', 'job':'emp_job'})
df

  emp_name  emp_age emp_gender    emp_job
0    alice       19          F    student
1     john       26          M    student
2     eric       22          M    student
3     paul       58          F    manager
4    peter       33          M   engineer
5    julie       44          F  scientist

In [108]:
df = users.copy()
df = df.rename(columns = {'name':'emp_name', 'gender':'emp_gender'})
df

  emp_name  age emp_gender        job
0    alice   19          F    student
1     john   26          M    student
2     eric   22          M    student
3     paul   58          F    manager
4    peter   33          M   engineer
5    julie   44          F  scientist

## **Group By on Data Frame**

In [109]:
df = users.copy()
df

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [110]:
for group, data_frame in users.groupby('job'):
    print (type(group), type(data_frame))
    print ("Group name:", group)
    print (data_frame)

<class 'str'> <class 'pandas.core.frame.DataFrame'>
Group name: engineer
    name  age gender       job
4  peter   33      M  engineer
<class 'str'> <class 'pandas.core.frame.DataFrame'>
Group name: manager
   name  age gender      job
3  paul   58      F  manager
<class 'str'> <class 'pandas.core.frame.DataFrame'>
Group name: scientist
    name  age gender        job
5  julie   44      F  scientist
<class 'str'> <class 'pandas.core.frame.DataFrame'>
Group name: student
    name  age gender      job
0  alice   19      F  student
1   john   26      M  student
2   eric   22      M  student

In [111]:
for group, data_frame in users.groupby('gender'):
    print (type(group), type(data_frame))
    print ("Group name:", group)
    print (data_frame)

<class 'str'> <class 'pandas.core.frame.DataFrame'>
Group name: F
    name  age gender        job
0  alice   19      F    student
3   paul   58      F    manager
5  julie   44      F  scientist
<class 'str'> <class 'pandas.core.frame.DataFrame'>
Group name: M
    name  age gender       job
1   john   26      M   student
2   eric   22      M   student
4  peter   33      M  engineer

In [112]:
grouped_df = df.groupby('job').agg({'age':['sum','mean','max','min'], 'gender':'count'})
grouped_df

          age                    gender
          sum       mean max min  count
job
engineer   33  33.000000  33  33      1
manager    58  58.000000  58  58      1
scientist  44  44.000000  44  44      1
student    67  22.333333  26  19      3

In [113]:
grouped_df = df.groupby('gender').agg({'age':['sum','mean','max','min'], 'name':'count', 'gender':'count'})
grouped_df

        age                     name gender
        sum       mean max min count  count
gender
F       121  40.333333  58  19     3      3
M        81  27.000000  33  22     3      3

## **Reading Data on Data Frame from External Sources**

In [114]:
try:
    print("Reading the external csv data file...")
    # df = pd.read_csv("salary_table.csv")
    # df = pd.read_csv("C:\\Users\Arnab\AEC ML with Python Aug 2024\salary_table.csv")
    # df = pd.read_csv("C:\\Users\\Arnab\\AEC ML with Python Aug 2024\\salary_table.csv")
    # df = pd.read_csv("C:/Users/Arnab/AEC ML with Python Aug 2024/salary_table.csv")
    # df = pd.read_csv("C://Users//Arnab//AEC ML with Python Aug 2024//salary_table.csv")
    # df = pd.read_csv("C://Users/Arnab\\AEC ML with Python Aug 2024\salary_table.csv")
    df = pd.read_csv("./salary_table.csv")
except:
    print("File Access Error !!!")
    print("Data File could not be read successfully...")

Reading the external csv data file...
File Access Error !!!
Data File could not be read successfully...

In [115]:
print (df.shape)
df.head()

(6, 4)

    name  age gender       job
0  alice   19      F   student
1   john   26      M   student
2   eric   22      M   student
3   paul   58      F   manager
4  peter   33      M  engineer

In [116]:
try:
    print("Reading the external xlsx data file...")
    df = pd.read_excel("./ONLINE RETAIL.xlsx", sheet_name='Sheet2')
except:
    print("File Access Error !!!")
    print("Data File could not be read successfully...")

Reading the external xlsx data file...
File Access Error !!!
Data File could not be read successfully...

In [117]:
print (df.shape)
df.head()

(6, 4)

    name  age gender       job
0  alice   19      F   student
1   john   26      M   student
2   eric   22      M   student
3   paul   58      F   manager
4  peter   33      M  engineer

In [118]:
df1 = df.copy()
df1 = df1[["INVOICENO", "UNITPRICE", "CUSTOMERID", "COUNTRY"]]
df1.head()

KeyError: "None of [Index(['INVOICENO', 'UNITPRICE', 'CUSTOMERID', 'COUNTRY'], dtype='object')] are in the [columns]"

In [ ]:
df1.drop("INVOICENO", axis = 1, inplace=True)
df1.head()

In [ ]:
df1.insert(1, "TAX", df1.UNITPRICE * 0.10)
df1.head()

In [ ]:
# Replacing COUNTRY Column values
df1.COUNTRY.value_counts()

In [ ]:
df1['COUNTRY'].replace({"France":"Fr", "United Kingdom":"UK", "Australia":"Aus", "Netherlands":"Ned", "Germany":"Ger"}, inplace=True)
df1.head()

In [ ]:
df1['COUNTRY'].replace(["Fr","UK","Aus", "Ned","Ger"], ["France", "United Kingdom", "Australia", "Netherlands", "Germany"], inplace=True)
df1.head()

In [ ]:
# factorizing COUNTRY column values
df1.insert(4, "COUNTRY_CODE", pd.factorize(df1["COUNTRY"])[0])
df1

## **Reading External Data File in Google Colab**

In [ ]:
# Strategy-1
from google.colab import files
uploaded = files.upload()

In [ ]:
import io
import pandas as pd
df1 = pd.read_csv(io.BytesIO(uploaded['salary_table.csv']))
df1.head()

In [ ]:
# Strategy-2
from google.colab import drive
drive.mount("/content/gdrive")

In [ ]:
import pandas as pd
df = pd.read_csv("/content/gdrive/My Drive/iris.csv")
print (df.shape)
df.head()

In [ ]:
# Strategy-3
import pandas as pd
df = pd.read_csv("/content/MyDataFile/iris.csv")
print(df.shape)
df.head()

## **Data Visualization with Data Frame**

In [ ]:
df = pd.read_csv("salary_table.csv")
print (df.shape)
df.head()

In [ ]:
df.describe().T

In [ ]:
df.plot()

In [ ]:
df['experience'].plot()

In [ ]:
df.salary.plot()

In [ ]:
df.plot.bar()

In [ ]:
df.experience.plot.bar()

In [ ]:
df.plot.hist()

In [ ]:
df.experience.plot.hist()

In [ ]:
df.plot.line()

In [ ]:
df.experience.plot.line()

In [ ]:
df.salary.head(10).plot.pie()

In [ ]:
df.salary.head(10).plot.pie(autopct = "%.2f")

In [ ]:
df.plot(kind = "scatter", x = "experience", y = "salary", s = 40,
       title = "Experience (in years) vs. Salary (in INR)...")